const plugin = requirePlugin('live-plugin')
Page({
  data: {
    liveDesc:
      '这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍这是直播介绍',
    fileList: [
      {
        fileName: '发生复合微球发生的.pdf',
        fileTime: '2025-10-23 12:12:12',
      },
      {
        fileName: '发的伙食费士大夫发射点.docx',
        fileTime: '2025-10-23 12:12:12',
      },
      {
        fileName: '广泛大概.ppt',
        fileTime: '2025-10-23 12:12:12',
			},
			{
        fileName: '广泛大概.ppt',
        fileTime: '2025-10-23 12:12:12',
			},
			{
        fileName: '广泛大概.ppt',
        fileTime: '2025-10-23 12:12:12',
			},
			{
        fileName: '广泛大概.ppt',
        fileTime: '2025-10-23 12:12:12',
			},
			{
        fileName: '广泛大概.ppt',
        fileTime: '2025-10-23 12:12:12',
			},
			{
        fileName: '广泛大概.ppt',
        fileTime: '2025-10-23 12:12:12',
			},
			{
        fileName: '广泛大概.ppt',
        fileTime: '2025-10-23 12:12:12',
			},
			{
        fileName: '广泛大概.ppt',
        fileTime: '2025-10-23 12:12:12',
      },
		],
		tabs: [
      { title: '直播介绍' },
      { title: '文档' },
      { title: '聊天' }
    ]
  },
	onLoad() {},

	onTabChange(e) {
    console.log('切换到Tab:', e.detail.index, wx.onAppShow)
  },

	onStateChange(e) {
		console.log('播放状态:', e.detail)
	},
	onPlayerError(e) {
		console.error('播放器错误:', e.detail)
		wx.showToast({
			title: '播放出错',
			icon: 'none',
		})
	},

	onTokenExpired: function (e) {
		console.log('SS', e.detail)
	},
})
